# Question 1

In [8]:
import pandas as pd
pd.__version__

'1.0.5'

# Question 2

In [4]:
# importing Pandas & numpy 

import pandas as pd 

import numpy as np 

  
# numpy array 

data = np.array(['a', 'b', 'c', 'd', 'e']) 

  
# creating series 

s = pd.Series(data) 

print(s)

0    a
1    b
2    c
3    d
4    e
dtype: object

# Question 3

In [5]:

import pandas as pd 

  

  
# Creating the dataframe df 

df = pd.DataFrame({'Roll Number': ['20CSE29', '20CSE49', '20CSE36', '20CSE44'], 

                   'Name': ['Amelia', 'Sam', 'Dean', 'Jessica'], 

                   'Marks In Percentage': [97, 90, 70, 82], 

                   'Grade': ['A', 'A', 'C', 'B'], 

                   'Subject': ['Physics', 'Physics', 'Physics', 'Physics']}) 

  
# Printing the dataframe 
df

import pandas as pd 

  

  

df = pd.DataFrame({'Roll Number': ['20CSE29', '20CSE49', '20CSE36', '20CSE44'], 

                   'Name': ['Amelia', 'Sam', 'Dean', 'Jessica'], 

                   'Marks In Percentage': [97, 90, 70, 82], 

                   'Grade': ['A', 'A', 'C', 'B'], 

                   'Subject': ['Physics', 'Physics', 'Physics', 'Physics']}) 

  
# Printing the dataframe 

df['index'] = df.index 
df

  Roll Number     Name  Marks In Percentage Grade  Subject  index
0     20CSE29   Amelia                   97     A  Physics      0
1     20CSE49      Sam                   90     A  Physics      1
2     20CSE36     Dean                   70     C  Physics      2
3     20CSE44  Jessica                   82     B  Physics      3

# Question 4

In [1]:
import seaborn as sb

In [6]:
# list all dataset in seaborn, loaded mpg dataset
s= sb.get_dataset_names()
print(s)
d = sb.load_dataset('mpg')
d.head(5)

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'tips', 'titanic']

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

# Question 5

In [14]:
#country of origin of cars in mpg dataset, most cars are from usa
s= set(list(d['origin']))
print(s)

{'usa', 'europe', 'japan'}

# Question 6

In [16]:
#part of dataframe having origin usa
df = d[d['origin'] == 'usa']

In [18]:
df.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
392,27.0,4,151.0,90.0,2950,17.3,82,usa,chevrolet camaro
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10